views/Registroanimal/_form.php

    <?= $form->field($model, 'edad')->textInput(['maxlength' => true,'style'=>'width:250px']); ?>


    <?= $form->field($model, 'sexo')->dropDownList(
      ArrayHelper::map(sexo::find()->all(),'sexo','sexo'),
      ['prompt'=>'---Seleccionar Sexo---','style'=>'width:250px']
      )?>

      <?= $form->field($model, 'raza')->dropDownList(
        ArrayHelper::map(raza::find()->all(),'raza','raza'),
        ['prompt'=>'---Seleccionar Raza---','style'=>'width:250px']
        )?>

        <?= $form->field($model, 'especraza')->dropDownList(
          ArrayHelper::map(especraza::find()->all(),'especraza','especraza'),
          ['prompt'=>'---Seleccionar Raza Especifica---','style'=>'width:250px']
          )?>

          <?= $form->field($model, 'empadre')->dropDownList(
            ArrayHelper::map(empadre::find()->all(),'empadre','empadre'),
            ['prompt'=>'---Seleccionar Empadre---','style'=>'width:250px']
            )?>
    <?= $form->field($model, 'madre')->textInput(['maxlength'=>10,'style'=>'width:250px']) ?>
    <?= $form->field($model, 'estado')->dropDownList(
      ArrayHelper::map(estado::find()->all(),'estado','estado'),
      ['prompt'=>'---Seleccionar Estado del Animal---','style'=>'width:250px']
      )?>
---
SELECT * FROM `sexo`
SELECT * FROM `raza`
SELECT * FROM `especraza`
SELECT * FROM `empadre`
SELECT * FROM `estado`