views/Registroanimal/index.php

SELECT * FROM `sexo`
---
            'edad',
            [
    'attribute'=>'sexo',
    'filter'=>ArrayHelper::map(Sexo::find()->asArray()->all(), 'sexo', 'sexo'),

SELECT * FROM `raza`
---

            [
    'attribute'=>'raza',
    'filter'=>ArrayHelper::map(raza::find()->asArray()->all(), 'raza', 'raza'),

SELECT * FROM `especraza`
SELECT * FROM `empadre`
---

            [
    'attribute'=>'especraza',
    'filter'=>ArrayHelper::map(especraza::find()->asArray()->all(), 'especraza', 'especraza'),
],
[
'attribute'=>'empadre',
'filter'=>ArrayHelper::map(empadre::find()->asArray()->all(), 'empadre', 'empadre'),

SELECT * FROM `estado`
---
            'madre',
            [
    'attribute'=>'estado',
    'filter'=>ArrayHelper::map(estado::find()->asArray()->all(), 'estado', 'estado'),