models/User.php

        public static function isUserAdmin($id)
        {
           if (Usuarios::findOne(['Id_usuario' => $id, 'activate' => '1', 'role' => 2])){
---
SELECT * FROM `usuarios` WHERE (`Id_usuario`=1) AND (`activate`='1') AND (`role`=2)

        public static function isUserSimple($id)
        {
           if (Usuarios::findOne(['Id_usuario' => $id, 'activate' => '1', 'role' => 1])){
---
SELECT * FROM `usuarios` WHERE (`Id_usuario`=1) AND (`activate`='1') AND (`role`=1)