models/Usuarios.php

  	public static function findByUsername($username){
  		return self::findOne(['Usuario'=>$username]);
---
SELECT * FROM `usuarios` WHERE `Usuario`='julian144'